BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДатыРасписаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктуальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецРасписания</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОперацииШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

//@skip-warning
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка И НеВыполнятьПриЗагрузкеДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ И Замещение И ЭтотОбъект.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВладелецРасписания", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ВладелецРасписания.Значение), ЭтотОбъект.Отбор.ВладелецРасписания.Значение, ""));
		Запрос.УстановитьПараметр("ПлановаяДата", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ПлановаяДата.Значение),  ЭтотОбъект.Отбор.ПлановаяДата.Значение, ""));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыРасписаний.ВладелецРасписания,
		|	ДатыРасписаний.ПлановаяОперация
		|ИЗ
		|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
		|ГДЕ
		|	(&ВладелецРасписания = """"
		|			ИЛИ ДатыРасписаний.ВладелецРасписания = &ВладелецРасписания)
		|	И (&ПлановаяДата = """"
		|			ИЛИ ДатыРасписаний.ПлановаяДата = &ПлановаяДата)
		|	И ДатыРасписаний.ПлановаяОперация <> Неопределено";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ВладелецРасписания) И ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
				Запись = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
				Запись.Шаблон   = Выборка.ВладелецРасписания;
				Запись.Операция = Выборка.ПлановаяОперация;
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Запись.Удалить();
				КонецЕсли; 
			КонецЕсли; 
		
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка И НеВыполнятьПриЗагрузкеДанных() Тогда
		Возврат;
	КонецЕсли;
	
	СписокОпераций = Новый Массив;
	
	Если НЕ Отказ И ЭтотОбъект.Количество() > 0 Тогда
		
		Для Каждого ЗаписьЭтогоОбъекта Из ЭтотОбъект Цикл
			
			Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.АктуальнаяДата) И ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ПлановаяОперация) Тогда
				
				Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
				Набор.Отбор.Шаблон.Установить(ЗаписьЭтогоОбъекта.ВладелецРасписания);
				Набор.Отбор.Операция.Установить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				
				ЗаписьОперацииШаблона = Набор.Добавить();
				ЗаписьОперацииШаблона.Шаблон       = ЗаписьЭтогоОбъекта.ВладелецРасписания;
				ЗаписьОперацииШаблона.Операция     = ЗаписьЭтогоОбъекта.ПлановаяОперация;
				ЗаписьОперацииШаблона.ПлановаяДата = ЗаписьЭтогоОбъекта.ПлановаяДата;
				Если ОбменДанными.Загрузка Тогда
					ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка(Набор, Истина, Ложь, ОбменДанными.Отправитель);
				КонецЕсли;
				Набор.Записать(Истина);
				
				Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ВладелецРасписания) 
					И ЗаписьЭтогоОбъекта.ВладелецРасписания <> ЗаписьЭтогоОбъекта.ПлановаяОперация Тогда
					СписокОпераций.Добавить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокОпераций) Тогда
			// Поскольку операции добавлены в даты шаблона, они не могут оставаться запланированными без шаблона
			ПлановыеОперации.УдалитьДатуОперацийЗапланированныхБезШаблона(СписокОпераций, 
					ОбменДанными.Загрузка, ОбменДанными.Отправитель);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ВспомогательныйФункционал

Функция НеВыполнятьПриЗагрузкеДанных()
	
	Возврат ЗначениеЗаполнено(ОбменДанными.Отправитель)
		И ТипЗнч(ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.СинхронизацияАвтономныхКопий")
		И Не ОбменДанными.Отправитель.МобильноеУстройство;
	
КонецФункции

#КонецОбласти

#КонецЕсли
